<a href="https://colab.research.google.com/github/AlexsanderPessoa/Aprendizado-de-Banco-de-Dados/blob/main/Aprendizado_banco_de_dados_agroadvance.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
/* DLL - Data Definition Language */

/* A linguagem de definição de dados se ocupa de modificar 
a estrutura de objetos de uma DB.

Ela é constituida por diferentes setenças que nos permite criar, 
modificar, apagar ou definir a estrutura das tabelas que 
armazenam dados. */

/* Create, Alter, Drop, Truncate */

CREATE DATABASE AGROADVANCE;
CREATE SCHEMA AGROADVANCE2;
USE AGROADVANCE;

/* Em outros gerenciadores pode haver diferença entre 
database e schema, dentro de um schema eu posso inserir vários 
database */

/* eu chamei de agroadvance2, pois no mysql eles são iguais e 
não pode haver repetição */

CREATE TABLE pagamentos (
id_pay	INT NOT NULL AUTO_INCREMENT PRIMARY KEY,
valor	REAL NOT NULL,
moeda	VARCHAR(20) NOT NULL,
data_pagamento DATE NOT NULL,
tipo_pagamento VARCHAR(50),
id_usuario INT NOT NULL,
id_empresa INT NOT NULL
);

SELECT * FROM pagamentos;
/* estou selacionando a tabela pagamentos */

DESCRIBE pagamentos;
/* Não é DLL */
/* na coluna default, serve caso nada seja add na tabela, 
ele irá com um valor padrão já pre estabelecido */

ALTER TABLE pagamentos
ADD age INT;
/* eu alterei a tabela pagamentos e add uma coluna
chamada: age, do tipo inteiro */
/* agora quando eu chamar de novo o SELECT * FROM pagamentos,
deve aparecer uma coluna a mais referente a que eu criei. */

SELECT * FROM pagamentos;
/* não preciso escrever o codigo de novo, basta eu selecinar 
o código lá em cima e mandar rodar no icone com o desenho de raio. */

/* Posso modificar uma coluna que eu já crie
nesse caso vou alterar a coluna age de inteiro para um varchar */

ALTER TABLE pagamentos
MODIFY age NVARCHAR(50) NOT NULL;
/* NVARCHAR pode ser add tanto strings quanto numeros */
/* CUIDADO, embaixo recebemos uma alerta, isso não é um erro
significa que não está de acordo com os novos padroes, mas funciona normalmente,
mas precisa tomar cuidado com os caracter, no nosso exemplo que estamos passando
irá funcionar normalmente. */
/* vamos olhar de novo */

DESCRIBE pagamentos;

/* Caso eu precise mudar o nome da minha coluna, utilizo o change, 
aqui eu mudei de age para idade */
ALTER TABLE pagamentos
CHANGE COLUMN age idade VARCHAR(50) NOT NULL;

/* Eu quero deletar a coluna idade que foi criado */
ALTER TABLE pagamentos
DROP COLUMN idade;

/*   */
ALTER TABLE pagamentos
RENAME TO pagamento_do_mes;

SELECT * FROM pagamentos;